app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "fart!"], ["created_at", Wed, 19 Jun 2013 05:01:12 UTC +00:00], ["updated_at", Wed, 19 Jun 2013 05:01:12 UTC +00:00], ["user_id", 1]]